IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultInteractionEc2
ULS Check Interaction Ec2

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultInteractionEc2.Ned
Design value of the applied axial force

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultInteractionEc2.Medy
Design value of the applied bending moment around y axis

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultInteractionEc2.Medz
Design value of the applied bending moment around z axis

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultInteractionEc2.Ved
Design value of the applied shear force

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultInteractionEc2.Ted
Design value of the applied torsional moment

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultInteractionEc2.CheckValueShearAndTorsion
Calculated value of the exploitation of the cross-section (for interaction of shear and torsion) related to the limit value

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultInteractionEc2.CheckValueShearTorsionAndBending
Calculated value of the exploitation of the cross-section (for interaction of shear, torsion and bending) related to the limit value